{
    "_json_description": "Json para la configuracion de textos estaticos, de la aplicacion ht",
    "_json_version": "0.3.0",
    "pages": {
        "main_page": {
            "title": "High Thoughput Collection",
            "descripcion": "The high-throughput transcription factor binding sites (TFBS) dataset collection is composed of datasets generated by ChIP-seq experiments. \n**Summary**\nThis collection contains 28 datasets related to 12 different TFs. \nSee the [list of datasets](https://drive.google.com/drive/folders/1K-eV5UPtHI_z6nJ4_XyiWOkhX7k4Hx9Y) in this collection. \n **Creation of the collection** \n1. PubMed is searched for articles relating high-throughput experiments, and specifically using the ChIP-seq technology. The articles are carefully selected and curated.\n2. **Annotation process** \n   a. The data reported in the curated articles is reported and detailed in a dataset registry, where a dataset is composed of a given sample and its technical and/or biological replicates, when available, as well as the targeted TF and the experimental condition (organism, strain, temperature, medium, medium supplements, pH, etc). Each dataset is also associated with its “series ID” (whether from GEO or ArrayExpress), the experiment platform, the article’s PMID, the reference genome, and the control samples if provided. \n    b. The supplementary files reported by the authors are downloaded, specifically the identified binding sites and their coordinates. These files are formatted into a pre-defined model.\n    c. The curation process associates the TFBS files with their corresponding dataset, TF and associated metadata. \n3. **Uniformization**. This step allows the standardization of all the datasets in the collection. \n    a. Starting with the dataset table, series and sample IDs are extracted in order to automatize the downloading of all of the raw Fastq files composing each dataset (treatment sample, control, replicates). \n    b. The raw data is pre-processed: each sample is independently cleaned, trimmed, mapped to the reference genome, and sequencing quality is verified. The peak-calling step is performed, using the aligned samples and their controls. It consists in detecting regions of the genome where a significant amount of reads were mapped, likely to indicate a binding position. This step generates a single, bed-formatted peak file for each dataset.\n    c. The post-processing consists in identifying actual binding sites inside of the peaks regions. For each dataset, the TF motif available in RegulonDB is used for pattern-matching using RSAT matrix-scan. When a known motif is not available, a putative one is generated through *de novo* motif search in the peaks regions using RSAT peak-motifs. The identified binding sites are then used to build a new binding matrix, specific to each dataset. \n4. **Mapping with RegulonDB and other datasets**. RegulonDB currently holds the biggest collection of transcriptional regulatory binding sites for E. coli. Binding sites identified in the ChIP-seq datasets are compared to the RegulonDB collection, in order to tag those as formerly known or potentially new. ChIP-seq datasets of a given TF are also compared to each other. Finally, all binding sites are associated with their closest gene(s) and its product. ",
            "_collection_coments": "El elemento 'collection' es un arreglo donde se pueden declarar las colecciones, cuidar que el identificador sea diferente. ",
            "collection": [{
                    "id": "DS-001",
                    "url": "TFBINDING",
                    "title": "TF Binding Sites",
                    "description": "descripcion",
                    "enable": true
                },
                {
                    "id": "DS-002",
                    "url": "HT-TUs",
                    "title": "Transcription Units",
                    "description": "descripcion",
                    "enable": false
                },
                {
                    "id": "DS-003",
                    "url": "HT-TTs",
                    "title": "Transcription Termination Sites",
                    "description": "descripcion",
                    "enable": false
                },
                {
                    "id": "DS-004",
                    "url": "HT-TSS",
                    "title": "Transcription Start Sites",
                    "description": "descripcion",
                    "enable": false
                },
                {
                    "id": "DS-005",
                    "url": "HT-GE",
                    "title": "Gene Expression",
                    "description": "descripcion",
                    "enable": false
                }
            ]
        },
        "builder_page": {
            "title": "Query Builder",
            "description": ""
        },
        "result_page": {
            "title": "Results of",
            "description": ""
        },
        "dataset_page": {
            "description": "descripcion",
            "sections": {
                "dataset_info": {
                    "title": "DATASET",
                    "description": ""
                },
                "dataset_tf": {
                    "title": "TRANSCRIPTION FACTOR",
                    "description": ""
                },
                "dataset_growthc": {
                    "title": "GROWTH CONDITION",
                    "description": ""
                },
                "dataset_author_data": {
                    "title": "AUTHOR DATA",
                    "description": ""
                },
                "dataset_igv": {
                    "title": "GENOME VIEWER",
                    "description": ""
                }
            }
        }
    }
}